{
    "source": "https://huggingface.co/Qwen/Qwen2-7B/blob/main/config.json",
    "_name_or_path": "Qwen/Qwen2-7B",
    "architectures": [
      "Qwen2ForCausalLM"
    ],
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 3584,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "max_position_embeddings": 131072,
    "max_window_layers": 28,
    "model_type": "qwen2",
    "num_attention_heads": 28,
    "num_hidden_layers": 28,
    "num_key_value_heads": 4,
    "rms_norm_eps": 1e-06,
    "pretraining_tp": 1,
    "rope_theta": 1000000.0,
    "tie_word_embeddings": false,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.31.0.dev0",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 152064
  }